<div class="cds_course_intro_wrapper">
    <div class="cds_left_column">
        <div class="cds_sign_up_box">
            <a class="assign_to_course" href="#" rel="#sign_up_form">Записаться</a>
        </div>

        <h3 class="audience_header">Для кого</h3>
		<p> Для тех, кому удобно заниматься <strong>утром в будние дни</strong>. Программа курса полность идентична курсу <a href="http://www.webcamp.com.ua/courses/frontend-basic">Frontend-базовый</a></p>
        <p> Вы хотите создать свой сайт или освоить профессию вэб-дизайнера?</p>
        <p> И вы уже приняли решение, о том, что вы не можете оставаться в стороне, вам надо идти в ногу со временем - создать свой сайт либо зарабатывать на этом деньги. И вы хотите делать не просто сайты, но такие сайты, которые заставят посетителя их любить. Все знают, что сердце клиента завовевывает не только хороший продукт, но и эстетическое удовольствие от вэб дизайна, удобство интерфейса (user experience) и функциональные возможности.</p>
        <p> Вы уже знаете, что для создания сайта вам нужно овладеть некоторыми знаниями и умениями, такими как HTML5, CSS и Javascript, все это одним словом можо назвать frontend или вэб дизайн, то есть, вся видимая для пользователей часть работы сайта. Тогда, вам остается совсем не много - научиться создавать по настоящему привлекательные, запоминающиеся и красивые сайты на курсе <b>frontend базовый</b> в webcamp.</p>

    </div>
    <div class="cds_right_column">
        <h3 class="knowledge_header">Вы сможете:</h3>
        <ul>
            <li>Свободно использовать язык гипер-разметки в версии <strong>HTML5</strong>;</li>
            <li>Создавать неповторимый стиль с помощью <strong>CSS3</strong>;<li>
            <li>Использовать самый популярный сегодня фреймворк <strong>Bootstrap</strong> (что невероятно украсит ваше резюме);</li>
            <li>Делать великолепные сайты под все браузеры, любые планшеты и смартфоны;</li>
            <li>Использовать главное секретное оружие профессиональных вэб дизайнеров - ошеломительную типографику;</li>
            <li>Оценить эффект, который производит ваша работа на посетителей с помощью мощного сервиса Google analytics;</li>
            <li>И главное: уже по окончанию базового курса frontend, вы сможете создавать простые сайты-визитки, что тоже стоит денег.</li>
        </ul>
        <h3 class="knowledge_header">Проект курса</h3>
        <p>
	        Весь курс мы будем работать над созданием собственного сайта - <strong>вэб странички со своим резюме</strong>, которая обязательно вызовет первоначальный интерес работодателя.
        </p>
        <p>
	        <img src="../images/ads/winner.png">
        </p>
    </div>
</div>
        <div class="ytb">
        <h3 class="no-margin">Демо проекта, который завершили студенты предыдущей группы frontend базовый.</h3>
        	<a href="#" target="_blank"><img src="../../images/courses/frontend_basic_demo.png"></a>
        </div>
<div class="cds_course_program_wrapper">
    <h3 class="program_header">Программа курса «Frontend базовый»</h3>

    <div class="cds_left_column">
        <h6>Первое занятие</h6>
        <ul>
            <li>Знакомимся с основами разметки HTML;</li>
            <li>создаем базовую разметку html в программе блокнот;</li>
            <li>тренируемся использовать различные элементы html (header, div, p и пр.);</li>
        </ul>

        <h6>Второе занятие</h6>
        <ul>
            <li>подключаем внешний файл со стилем css;</li>
            <li>прописываем первые стили: центровка текста, центровка блока header;</li>
            <li>знакомимся с сервисом google fonts;</li>
            <li>используем дополнительные шрифты google fonts - прописываем путь в html и правила css;</li>
            <li>добавляем картинки;</li>
            <li>знакомимся с цветом и рамками;</li>
            <li>используем media queries для создания адаптивного дизайна для маленьких размеров экрана;</li>
        </ul>

        <h6>Третье занятие</h6>
        <ul>
            <li>создаем колоночную систему разметки (с помощью div и float);</li>
            <li>добавляем еще шрифтов из google fonts;</li>
            <li>используем span и псевдоселектор :before и background для создания иконок;</li>

        </ul>


        <h6>Четвертое занятие</h6>
        <ul>
            <li>оформляем footer;</li>
            <li>знакомимся с понятием кроссбраузерности (modernizr, browserstack, virtualbox как инструмент кроссбраузерного тестирования);</li>
        <h6>Пятое занятие</h6>
        <ul>
            <li>еще больше css:</li>
            <li>позиционирование;</li>
            <li>группирование;</li>
            <li>наследование;</li>
            <li>каскадирование;</li>
        </ul>
        <h6>Шестое занятие</h6>
        <ul>
	        <li>знакомимся с bootstrap;</li>
	        <li>колоночная система с bootstrap;</li>
	        <li>создадим копию нашей страницы уже с использованием bootstrap;</li>
        </ul>
        </ul>



    </div>

<div class="cds_right_column">
        <h6>Седьмое занятие</h6>
        <ul>
        	<li>знакомимся с javascript;</li>
	        <li>продолжаем работать с bootstrap;</li>
	        <li>используем стили bootstrap;</li>
        </ul>

        <h6>Восьмое занятие</h6>
        <ul>
        	<li>углубляемся в javascript: типы данных, переменные, свойства и методы;</li>
	        <li>заканчиваем работать с bootstrap;</li>
	        <li>по желанию, покупаем доменное имя и хостинг либо временно получаем ссылку и хостинг от webcamp;</li>
        </ul>

        <h6>Девятое занятие</h6>
        <ul>
	        <li>активно используем объекты javascript;</li>
	        <li>знакомимся с понятием DOM и применяем javascript в html документе;</li>
	        <li>применяем новые возможности CSS3</li>
        </ul>

        <h6>Десятое занятие</h6>
        <ul>
        	<li>знакомимся с массивами и функциями javascript;</li>
	        <li>знакомимся с понятием SEO;</li>
	        <li>оптимизируем сайт;</li>
        </ul>

        <h6>Одинадцатое занятие</h6>
        <ul>
	        <li>закрепляем пройденный материал;</li>
	        <li>решаем все вопросы, которые возникли в процессе самостоятельного выполнения второго собственного проекта;</li>
        </ul>

        <h6>Двенадцатое занятие</h6>
        <ul>
	        <li>пишем небольшой тест по пройденному материалу;</li>
	        <li>получаем сертификат о прохождении курса;</li>
        </ul>


    </div>

</div>