<div class="cds_course_intro_wrapper">
    <div class="cds_left_column">
        <div class="cds_sign_up_box">
            <a class="assign_to_course" href="#" rel="#sign_up_form">Записаться</a>
        </div>

        <h3 class="audience_header">Для кого</h3>
        <ul>
        <li> Вы хотите создать свой сайт или освоить профессию веб-дизайнера?</li>
        <li> Вы уже работаете в IT и хотите преквалифицироваться?</li>
        <li> Вы хотите освоить новую для вас технологию но не хватает времени самостоятельно разобраться?</li>
        <li> Вам не подходят наши групповые занятия по времени или программе?</li>
        <li> Вы готовы заниматься в рабочее время? </li>
        </ul>
        
        <p> Тогда специально для Вас мы оказываем услуги по индивидуальному (либо в маленьких группах с Вашими знакомыми) обучению по курсам <a href="http://www.webcamp.com.ua/courses/frontend-basic">Frontend-базовый</a> и <a href="http://www.webcamp.com.ua/courses/frontend-advanced">Frontend-продвинутый</a>, а также дополнительным технологиям и инструментам, которые не входят в программы данных курсов. </p>
        
        <p>Вы уже знаете, что для создания сайта вам нужно овладеть некоторыми базовыми знаниями и технологиями, такими как <b>HTML</b>, <b>CSS</b> и <b>Javascript</b> (одним словом frontend или веб-дизайн). Также, если Вы - опытный веб-разработчик для повышения своей квалификации и экономии времени разработки мы поможем Вам освоить современные инструменты и фреймворки. Тогда, Вам остается совсем не много - научиться создавать по настоящему привлекательные, запоминающиеся и красивые сайты на индивидуальном курсе <b>frontend</b> в Webcamp.</p>
        
        <h3 class="knowledge_header">Важная информация</h3>
        <ul>
        	<li>Индивидуальные занятия проходят по будним дням с 12.00 до 18.00;</li>
        	<li>Длительность занятия составляет 2-3 часа, время проведения согласовывается индивидуально;</li>
        	<li>Занятия проходят у нас в офисе;</li>
        	<li>Оплата за каждый курс расчитывается и согласовывается отдельно;</li>
        	<li>При занятии группой 2-3 человека стоимость составляет 300 грн/час с группы;</li>
        	<li>Один час занятий равен одному астрономическому часу и состоит из 60 минут.</li>
        </ul>
    </div>
    <div class="cds_right_column">
        <h3 class="knowledge_header">Мы обучаем:</h3>
        <h4>Разметка и верстка страницы:</h4>
        <ul>
            <li><strong> HTML/HTML5</strong> - обучение с нуля;</li>
            <li><strong> CSS/CSS3</strong> - обучение с нуля;</li>
            <li><strong> LESS/SASS</strong> - эффективная работа с CSS;</li>
            <li><strong> Twitter Bootstrap</strong> - библиотека готовых решений для верстальщика;</li>
            <li><strong> Landing Page design</strong> - разработка "одностраничного" целевого сайта для конкретного товара/услуги;</li>
            <li><strong> Responsive design</strong> - адаптивная верстка под различные размеры экрана; </li>
            <li><strong> Valid development</strong> - валидная верстка согласно стандартам W3C;</li>
            <li><strong> Кроссбраузерная верстка</strong> - как переверстать сайт в стиле 90-х чтобы его обработал <b>IE6</b>;</li>
            <li> Где взять красивые картинки, значки, шрифты бесплатно без регистрации и без смс.</li>
        </ul>
        <h4>Инструменты разработки и аналитики Google:</h4>
        <ul>
        	<li><strong> Google Analytics</strong> - установка, настройка, основы работы с инструментами аналитики;</li>
            <li><strong> Google AdWords</strong> - регистрация, настройка, создание и наполнение рекламных кампаний, работа в связке с  инструментами аналитики;</li>
            <li><strong> Google Webmaster Tools</strong> - как поднять сайт в выдаче поиска Google следуя рекомендациям Google.</li>
        </ul>
        <h4>JavaScript</h4>
        <ul>
        	<li><strong> JavaScript</strong> - чистый JS, основы, функции и замыкания, наследование, прототипирование, DOM. Программа соответствует курсу <a href="http://www.webcamp.com.ua/courses/frontend-advanced">Frontend-продвинутый</a>;</li>
        	<li><strong> jQuery</strong> - работа с DOM, AJAX, XHTML;</li>
        	<li><strong> Backbone.js</strong> - идеология, модели, коллекции, представления; требуются хорошие знания HTML/CSS/JS;</li>
        	<li><strong> Angular.js</strong> - разработка одностраничных приложений (Single Page Application); требуются хорошие знания HTML/CSS/JS;</li>
        	<li><strong> Node.js</strong> - установка, настройка и основы использования. Для тех, кто хочет использовать JS в качестве веб-сервера. Требует отличных знаний JS; </li>
        	<li><strong> MongoDb</strong> - нереляционная система управления базами данных, основы работы и почему node.js её лучший друг.</li>
        </ul>


      
    </div>
</div>