<div class="cds_course_intro_wrapper">
    <div class="cds_left_column">
        <div class="cds_sign_up_box">
            <a class="assign_to_course" href="#" rel="#sign_up_form">Записаться</a>
        </div>

        <h3 class="audience_header">Для кого</h3>
        <p>Наши <strong>курсы web программирования</strong> предназначены для тех, кто ничего не знает о PHP или обладает поверхностными знаниями, которых не достаточно для работы в IT-сфере, как <strong>программисту</strong>-профессионалу.</p>

        <h3 class="knowledge_header">Вы научитесь</h3>
        <ul>
            <li>Создавать комплексные web-сайты</li>
            <li>Приобретете базовые навыки программирования на языке PHP</li>
        </ul>
    </div>

    <div class="cds_right_column">
        <h3 class="description_header">Описание курса</h3>
        <p>WebCamp в рамках такого курса, как «Php Базовый» предлагает ознакомиться со следующими понятиями:</p>
        <ul class="circle_list_img">
            <li>Создание динамических веб-страниц</li>
            <li>Создание и подключение простых JS-скриптов</li>
            <li>Создание веб-страниц при помощи HTML</li>
            <li>Основы программирование на РНР</li>
            <li>Основы работы с базами данных на примере СУБД MySQL</li>
            <li>Оформление визуального представления Web-страниц при помощи СSS</li>
        </ul>
        <p>Задачей наших преподавателей во время курсов веб программирования для начинающих является ввести вас в процесс программирования, ознакомить с имеющимися базами данных и добиться от вас понимания принципов ООП в создании Web-страниц.</p>
        <p>
	        <img src="../images/ads/winner.png">
        </p>
    </div>
</div>

<div class="cds_course_program_wrapper">
    <h3 class="program_header php">Программа курса «Php Базовый»</h3>

    <div class="cds_left_column">
        <h6>Введение в HTML <small>(язык гипертекстовой разметки)</small></h6>
        <p>
            Вначале вы ознакомитесь с данным понятием и узнаете, что такое размещение web-страниц на сервере. Также вы ознакомитесь с такими темами, как создание html-документа, структура web-узла, html-теги, определение свойств страниц, их форматирование, стили форматирования, ссылки, гиперссылки, создание форм, списков, таблиц, а также вставка изображений и редакторы для работы с языком html.
            <br>Кроме того, во время введения в HTML <strong>курса web программирования</strong> мы ознакомим вас и с новым HTML5, в том числе, рассказав и о его отличии от XHTML.
        </p>

        <h6>Введение в РНР</h6>
        <p>
            На данном этапе мы начнем с краткой истории, а также с преимуществ и недостатков языка РНР. Далее вы ознакомитесь с таким: установка РНР, тестирование его после установки, обзор установок на Windows, ОС Unix и Linux, установка веб-сервера Apache и необходимость этого, а также виртуальные хосты и обзор редактор, которые могут работать с РНР.
            <br>Далее во время <strong>обучения web программирования</strong> вы ознакомитесь с <strong>основами PHP</strong>: синтаксис, работа с файлами PHP, ОПП в PHP и работа с СУБД
            <br>Подводя итого, хотелось бы сказать, что даже при минимальном  уровне подготовки вы сможете овладеть навыками <strong>web программирования, обучение</strong> которым вам предоставим мы – команда WebCamp. Такие квалифицированные специалисты как у нас и все <strong>курсы по веб программированию</strong> – это то, что даст вам возможность улучшить и повысить культуру написания кода, а также работать с веб-приложениями.
        </p>
    </div>
    <div class="cds_right_column">
        <h6>Введение в СSS <small>(каскадные таблицы стилей)</small></h6>
        <p>
            Во время этой части курса «Php Базовый» ваш план ознакомления с материалом будет выглядеть следующим образом: понятие «каскадные таблицы стилей», способы их определения, добавления их в теги HTML, а также на веб-страницу.
            <br>Далее, определение стилей посредством идентификаторов и классов, позиционирование элементов, наследование родительских свойств, а также работа со шрифтами. Управление существующими значениями свойств (свойства блочного и обычного текста), определение каскадного порядка, изменение отступа между строчками, установка разрыва, интервал между словами, выравнивание, а также определение нескольких значений для шрифта одновременно.
            <br>Далее на этом этапе курса вы узнаете, что такое элемент, управление позиционированием и видимостью экрана, изменение внешнего дива элемента настройка его положения. А также научитесь управлять интерфейсом, списком и таблицей, после ознакомившись с динамическими технологиями CSS, навигацией, управлением и импортом внешнего содержимого.
        <p>

        <h6>Введение в JavaScript</h6>
        <p>
            Во время этого этапа курса «Php Базовый» вы узнаете о назначении JavaScript, комментариях,  выражениях и операциях, циклах, типах данных, операторах, локальных и глобальных переменных, а также о таких понятиях  как функция и встроенные функции.
        <p>
    </div>
</div>
