<div class="cds_course_intro_wrapper">
    <div class="cds_left_column">
        <div class="cds_sign_up_box">
            <a class="assign_to_course" href="#" rel="#sign_up_form">Записаться</a>
        </div>

        <h3 class="audience_header">Для кого</h3>
        <p>Вы уже не новичок в PHP (даже с опытом работы) и готовы покорять новые вершины?
	        <strong>PHP фреймворк Symfony</strong> - это новый уровень ваших профессиональных возможностей (и оплата на порядок выше).
        </p>
       
        <p>Набор инструментов и методик <strong>PHP фреймворка Symfony</strong> позволяет разработчику быть более продуктивным и выполнять задания эффективней, а с лучшими практиками (best practices) <strong>Symfony</strong> вы добъетесь ошеломительного взлета по карьерной лестнице.</p>
        <p>Добиться непревзойденных результатов с <strong>PHP фреймворком Symfony</strong> вам поможет курс <strong>Webcamp</strong>.</p>
       
       <h3 class="audience_header">Вы не в Киеве</h3>
        <p>Если вы не в Киеве, но все же хотите выучиться и получить работу с достойной оплатой, вас заинтересует обучение для <a href="http://www.webcamp.com.ua/skype-student">Skype-студентов.</a></p>
    </div>

    <div class="cds_right_column">
        <h3 class="knowledge_header">Вы сможете</h3>
        <ul>
            <li>Создать проект, которым можно покрасоваться перед работодателем или использовать для собственного бизнеса;</li>
            <li>Выполнять задачи вэб разработки продвинутого уровня;</li>
            <li>Работать в команде над выполением проекта;</li>
            <li>Освоить систему контроля версий;</li>
            <li>Претендовать на должность на уровень выше;</li>
        </ul>
        <h3 class="knowledge_header">Проект курса</h3>
        <p>Вместе со студентами мы выберем серьезный проект (например, интернет-магазин), над которым будет работать вся группа.</p>
        <p>Такой проект будет прекрасным дополнением вашего портфолио.</p>
        
        
            
</div>

<div class="cds_course_program_wrapper">
    <h3 class="program_header php">Программа курса «Php Symfony»</h3>

    <div class="cds_left_column">
        <h6>Первое знакомство с <strong>PHP фреймворком Symfony</strong></h6>
        <p> Уже с первого урока мы будем преследовать нашу главную цель - создать рабочий проект, таким образом, знакомство с <strong>Symfony</strong> начнеться с установки самого фреймворка.
        </p>
        
        <h6>Bundles</h6>
        <p>Как <strong>Symfony</strong> понимает собственный фен-шуй и другие принципы организации всего (файлов и папок) в нашем Symfony-проекте.</p>
        
        <h6>Controllers</h6>
        <p>Узнаем какая сила контролирует выполение всех задач в проекте с использованием <strong>Symfony</strong>, а также разберем понятия request и response, какими их видит <strong>Symfony</strong>.</p>
        
        <h6>Routing</h6>
        <p>Научимся задавать пути к новым страницам  и узнаем что такое аннотации в <strong>PHP фреймворке Symfony</strong></p>
        
    </div>
    <div class="cds_right_column">
    	
        <h6>View и Шаблоны <small>(язык twig)</small></h6>
    	<p>Показательная часть Symfony - это view, то есть, мы будем разбираться как продемонстрировать нашу работу пользователю.</p>
        <p>На этом этапе перейдем к внешнему виду проекта и удивимся какой легкой и простой становится frontend разработка с <strong>PHP фреймворком Symfony</strong>, а также специально созданным для этих целей языком twig.</p>
        
        <h6>Базы данных и ORM <small>(Doctrine)</small></h6>
        <p>Невероятно, но с Symfony, базы данных - это совсем не страшно, секрет кроется в Doctrine, которая делает за вас почти все, нам останется только разобраться в самой Doctrine.</p>
        
    </div>
</div>