<div class="cds_course_intro_wrapper">
    <div class="cds_left_column">
        <div class="cds_sign_up_box">
            <a class="assign_to_course" href="#" rel="#sign_up_form">Записаться</a>
        </div>

        <h3 class="audience_header">Для кого</h3>
        <p>Полный, профессиональный курс, для желающих освоить PHP на высоком уровне, научиться работать по современным методологиям разработки.
           Курс предназначен для тех кто уже понимает что такое PHP, понимает принципы ООП на начальном уровне.
           Вы сможете найти свою первую работу еще в процессе обучения на данном курсе!
        </p>
<h3 class="description_header">Описание курса</h3>
		<p>WebCamp в рамках курса «<b>Php-продвинутый</b>» предлагает ознакомиться со следующими понятиями:</p>
        <ul class="circle_list_img">
            <li>Методология разработки программного обеспечения;</li>
            <li>Система контроля версий;</li>
            <li>Углубленное понимание ООП;</li>
            <li>Основы проектирования;</li>
            <li>Введение в использование фреймворков;</li>
        </ul>

    </div>

    <div class="cds_right_column">
         <h3 class="knowledge_header">Вы научитесь</h3>
                <ul>
                    <li>Максимально использовать все возможности ООП в PHP</li>
                    <li>Использовать архитектурный шаблон проектирования MVC</li>
                    <li>Использовать различные шаблоны проектирования</li>
                    <li>Проектировать сложную архитектуру</li>
                    <li>Использовать систему контроля версий</li>
                    <li>Работать по новейшим методологиям разработки</li>
                    <li>Правильно осуществлять рефакторинг кода</li>
                    <li>Правильно организовывать процесс разработки от начала до конца</li>
                    <li>Иметь практический опыт реализации основных современных функциональных решений</li>
                    <li>Работать в OC Linux</li>
                    <li>Самостоятельно устанавливать и настраивать Nginx, PHP, MySQL</li>
                </ul>
          <h3 class="audience_header">Вы не в Киеве</h3>
        <p>Если вы не в Киеве, но все же хотите выучиться и получить работу с достойной оплатой, вас заинтересует обучение для <a href="http://www.webcamp.com.ua/skype-student">Skype-студентов.</a></p>
    </div>
</div>

<div class="cds_course_program_wrapper">
    <h3 class="program_header php">Программа курса «Php Продвинутый»</h3>
 <div class="cds_left_column">
        <h6>Установка и настройка Nginx, PHP, MySQL на примере Debian Linux</h6>
        <ul class="circle_list_img">
            <li>Базовое знакомство с ОС Linux</li>
            <li>Настройка Nginx, PHP, MySQL стека</li>
        </ul>
        <h6>Методологии разработки программного обеспечения, контроль версий</h6>
        <ul class="circle_list_img">
			<li>Методология разработки программного обеспечения на примере <b>Scrum</b></li>
			<li>Система контроля версий, использование репозитория на примере <b>git</b></li>
        </ul>
        <h6>Работа с файлами</h6>
        <ul class="circle_list_img">
            <li>Работа с файлами</li>
			<li>Форматы данных <b>json</b>, <b>serialize</b>, <b>csv</b></li>
        </ul>
    </div>
    <div class="cds_right_column">
        <h6>Объектно Ориентированный Подход</h6>
                <ul class="circle_list_img">
                    <li>Интерфейсы, TypeCasting</li>
                    <li>Магические методы(__get, __call, __callStatic, __toString, ... )</li>
                    <li>Основы проектирования, на примерах шаблонов Singleton, Registry,Factory, Abstract Factory</li>
                </ul>
    </div>
</div>