<?php
PageInfo::setTitle("Webcamp — школа компьютерных курсов в Киеве");
PageInfo::setMenuItem("О нас");

Parts::renderStartPage();
?>
    <div class="about_us_content">
        <h3 class="iconography_on_our_courses_header">На наших курсах</h3>
        <img src="images/about_us/our_courses.png" height="420" width="940">
        <h3 class="iconography_on_other_courses_header">На других курсах</h3>
        <img class="iconography_on_other_courses" src="images/about_us/other_courses.png" height="147" width="940">
        <p>Приветствуем вас на WebCamp!</p>
        <p>Хотелось бы сразу сказать: если вы у нас «в гостях», то это свидетельствует о принятии вами твердого и четкого решения стать лучшим из лучших в области IT-технологий. И это верно! Ведь самое главное – ваше стремление и трудолюбие, а в остальном вам поможет наша молодая команда WebCamp– коллектив квалифицированных специалистов и самоотверженных ребят.</p>
        <p>WebCamp является сегодня учебным центром для тех, кто хочет идти в ногу со временем, а также знакомиться с современными технологиями 21-го столетия. Наша помощь вам – это не просто «курсы для чайников», которые нужны для так называемой «корочки». Курсы WebCamp, это:</p>
        <ul class="about_us_privilages_list">
            <li>Обучение самым новым программам, помогающим расширись свой лексикон в программировании</li>
            <li>Сертифицированные тренеры с глубокими знаниями, основанными на практике</li>
            <li>Комплексные программы, тренинги, авторские курсы</li>
            <li>Налаженные учебный процесс, аудитории с современным оборудованием, удобное расписание</li>
            <li>Сертификация IT специалистов и тестирование</li>
            <li>Дальнейшее трудоустройство (помощь)</li>
        </ul>
        <p>Взращивая в себе все эти знания, которыми мы наделим вас, вы будете идти к тому, чтобы стать IT-специалистом самого высокого уровня.</p>
        <p>Цель WebCamp тождественна цели известного скаутского движения: «Помощь молодежи в самостоятельном мышлении!». Мы хотим сделать из вас абсолютно владеющими своими знаниям специалистами. В вас обязательно должны проснуться лидерские качества, наталкивающие на мысли о том, что ваши умения должны соответственно оплачиваться.</p>
        <p>Девиз WebCamp, как и девиз у представителей данного скаутского движения – «Ве prepared», что означает «Будьте готовы». Таким образом, мы говорим: вы будете готовы ко всем трудностям на пути высоких достижений. Мы будем учиться с вами развиваться и зарабатывать. Наша вам помощь  - ваше светлое и обеспеченное будущее!</p>
    </div>
<?php Parts::renderEndPage(); ?>