<?php
PageInfo::setTitle("Акции - Курсы программирования Webcamp в Киеве");
PageInfo::setMenuItem("Акции");

Parts::renderStartPage();
?>
    <div class="promotions_content">
        <p>
            Благодаря <b>акционным предложениям</b> нашей компании вы сможете еще больше сэкономить и, одновременно, получить качественной обучение, которое обеспечит вас престижной работой в дальнейшем.
        </p>
        <ul class="promotions_raw">
            <li>
                <img src="/images/promotions/open_lesson.jpg" alt="">
                <p>
                    <b>Открытый урок</b>: ознакомьтесь на открытом и абсолютно бесплатном уроке с нашими программами, преподавателями, а после выберете то, что наиболее вам подходит.
                </p>
            </li>
            <li>
                <img src="/images/promotions/1_friend.jpg" alt="">
                <p>
                    Акция «Приведи друга»: приведите на любой из курсов своего товарища или пройдите его вместе с ним и получи 25% скидку!
                </p>
            </li>
            <li>
                <img src="/images/promotions/4_friends.jpg" alt="">
                <p>
                    Акция «Приведи 4-х друзей»: приведите 4 своих друзей, привлеките их к любому из курсов и сами занимайтесь абсолютно <b>бесплатно</b>!
                </p>
            </li>
        </ul>
        <ul class="promotions_raw">
            <li>
                <img src="/images/promotions/skype_student.png" alt="">
                <p>
                    <b>Skype-студент</b> - это предложение для иногородних и тех, кто не имеет возможности приезжать в аудиторию. Вы можете участвовать в обучении с помощью Skype. <a href="http://www.webcamp.com.ua/skype-student">Подробнее</a>
                </p>
            </li>
            <li>
                <img src="/images/promotions/certificate.jpg" alt="">
                <p>
                    Все, кто уже отучился на наших курсах, имеет возможность получить <b>сертификат об окончании курса</b>, а также хороши рекомендации от WebCamp, что также поможет в дальнейшем трудоустройстве.
                </p>
            </li>

        </ul>
    </div>
<?php Parts::renderEndPage() ?>